//Скласти програму для рішення задачі: Заданий масив x. Розрахувати значення елементів масиву y відповідно до заданого варіанта (див. таблицю 10.2).
//Вивести на екран масиви x і y(у стовпець).Знайти максимальний і мінімальний елементи масиву y.

#include <iostream>
#include <conio.h>
#include <cmath>
using namespace std;
void main()
{
	setlocale(0, "RUS");
	int const n = 12;
	int w[n];
	int i;
	int t[n];
	cout << "Введите элементы массива:\n";
	cin >> w[0];
	for (i = 1; i <= n - 1; i++)
	{
		cin >> w[i];
	}//Ввод массива
	for (i = 0; i <= n - 1; i++)
	{
		cout << w[i] << " ";
	}
	cout << "" << endl;// Вывод в ряд
	cout << "Чётные числа, кратные 3:  " << endl;
	for (i = 0; i < n; i++)
	{
		if ((w[i] % 2) == 0)
		{
			if (w[i] % 3 == 0)
			{
				cout << w[i] << endl;
			}
		}
	}//Выделил нужные числа
}