//Вариант 3.
//Описать структуру с именем STUDENT, содержащую поля :
// фамилия и инициалы;
// номер группы;
// успеваемость(массив из пяти элементов).
//Написать программу, выполняющую следующие действия :
// ввод с клавиатуры данных в массив, состоящий из 9 структур типа STUDENT;
// вывод на дисплей фамилий и номеров групп для всех студентов, включенных в
//массив, имеющих хотя бы одну оценку 2;
// если таких студентов нет, вывести соответствующее сообщение.
#include<iostream>
#include<string>
using namespace std;
struct STUDENT {
	char name[40];
	int group;
	int usp[5] /*= { {},{},{},{},{} }*/;
};
int main()
{
	setlocale(0, "RUS");
	int n = 9;
	int sch = 0;
	int sch1 = 0;
	for (int i = 0; i < 9; i++)
	{
		STUDENT* St = new STUDENT[i];
		cout << "Введите имя " << i << " студента: ";
		cin.getline(St[i].name, 40, '\n');
		cout << "Введите группу " << i << " студента: ";
		cin >> St[i].group;
		cout << "Введите оценки " << i << " студента: ";
		for (int j = 0; j < 5; j++)
		{
			cin >> St[i].usp[j];
		}
	for (int k = 0; k < 5; k++)
	{
		for (int l = 0; l < 5; l++)
		{
			if (St[k].usp[l] == 2)
			{
				cout << St[k].name << "\t" << St[k].group << endl;
			}
		}
	}
	}
	
}